n1 = input("Введите первый основной цвет (красный-1, синий-2, желтый-3): ")
n2 = input("Введите второй основной цвет (красный-1, синий-2, желтый-3): ")
if n1 not in ["1", "2", "3"] or n2 not in ["1", "2", "3"]:
    print("Ошибка. Введите номер цвета.")
else:
    if n1 == "1" and n2 == "2" or n1 == "2" and n2 == "1":
        print("Фиолетовый")
    if n1 == "1" and n2 == "3" or n1 == "3" and n2 == "1":
        print("Оранжевый")
    if n1 == "2" and n2 == "3" or n1 == "3" and n2 == "2":
        print("Зеленый")